import React from "react";
import { createUseStyles } from "react-jss";
import Box from "@mui/material/Box";
import Container from "@mui/material/Container";
import ScrollTop from "./sell/ScrollTop";
import Toolbar from "@mui/material/Toolbar";
import Fab from "@mui/material/Fab";
import KeyboardArrowUpIcon from "@mui/icons-material/KeyboardArrowUp";

const useStyles = createUseStyles({
  "@global": {
    body: {
      // backgroundColor: "brown",
      lineHeight: 2.5,
      fontFamily: "Noto Sans Armenian,Noto Sans,sans-serif",
    },
  },
  header: {
    fontSize: "32px",
  },
});

export default function UsageRules(props) {
  let classes = useStyles();
  return (
    <Container sx={{ mt: 2 }}>
      <Box
        sx={{
          height: 100,
          mt: 8,
          maxWidth: "960px",
          margin: [0, "auto"],
        }}
      >
        <div className={classes.div}>
          <p className={classes.header} id="back-to-top-anchor">
            Օգտագործման կանոնները
          </p>
          <p>Հարգելի օգտատեր</p>
          <p>
            Գրանցվելով Auto.am կայքում կամ հավելվածում` Դուք ընդունում եք սույն{" "}
            <strong>Օգտագործման կանոնները.</strong>
          </p>
          <br></br>
          <p>
            - Auto.am կայքը պատասխանատվություն չի կրում կայքում տեղադրված
            ավտոմեքենաների վաճառքի վերաբերյալ հայտարարությունների բովանդակության
            համար (գին, ավտոմեքենայի / տրանսպորտային միջոցի վերաբերյալ
            տեղեկատվության ճշգրտություն և այլն):
          </p>
          <p>
            - Auto.am կայքում մեկ&nbsp; հաշվով (account)&nbsp; թույլատրվում է
            տեղադրել մինչև 10 հայտարարություն ներառյալ.
          </p>
          <p>
            &nbsp;- <strong>Չի թույլատրվում</strong> նույն անձին տեղադրել մի
            քանի ավտոմեքենա տարբեր հաշիվներով (account): Գրանցվեք մեկ անգամ և
            օգտագործեք նույն հաշիվը&nbsp; ձեր մյուս հայտարարությունները
            տեղադրելու համար:<br></br>&nbsp;-{" "}
            <strong>Չի թույլատրվում կրկնել նույն հայտարարությունը՝</strong>{" "}
            տեղադրելով այն տարբեր մակնիշների եւ մոդելների մեջ։ Մեկ տրանսպորտային
            միջոցի հայտարարությունը տեղադրեք մեկ անգամ՝ հենց իր մակնիշի եւ
            մոդելի մեջ։
          </p>
          <p>
            &nbsp;- <strong>Չի թույլատրվում </strong>հայտարարության մեջ տեղադրել
            ավտոմեքենային չվերաբերող հայտարարություններ և տեղեկատվություն
            (պահեստամասեր, անշարժ գույք և այլն):
          </p>
          <p>
            &nbsp;- <strong>Չի թույլատրվում</strong> հայտարարության մեջ տեղադրել
            ավտոմեքենաներ և այլ տրանսպորտային միջոցների գնման հայտարարություններ
          </p>
          <p>
            - <strong>Չի թույլատրվում </strong>հայտարարության նկարների մեջ
            տեղադրել հայտարարությանը վերաբերող լրացուցիչ տեքստային ինֆորմացիա,
            նշաններ կամ պիտակներ։
          </p>
          <p>
            -<strong>&nbsp;Չի թույլատրվում</strong>&nbsp;նշել, որ տրանսպորտային
            միջոցի գտնվելու վայրը Հայաստանում է, եթե այն գտնվում արտերկրում կամ
            ճանապարհին է:&nbsp;
          </p>
          <p>
            -<strong>&nbsp;Չի թույլատրվում</strong>&nbsp;նշել, որ տրանսպորտային
            միջոցը մաքսազերծված է, եթե այն գտնվում է արտերկրում եւ դեռեւս չի
            մաքսազերծվել Հայաստանում:&nbsp;
          </p>
          <p>
            -<strong>&nbsp;Չի թույլատրվում</strong>&nbsp;Անձնական տվյալներ
            բաժնում, անուն ազգանուն դաշտերում նշել ընկերությունների կամ
            կազմակերպությունների անվանումներ: Նման հնարավորություն տալիս է միայն
            Դիլերական հաշիվը։
          </p>
          <p>
            <strong>-&nbsp;</strong>
            <strong>Չի</strong>
            <strong>&nbsp;</strong>
            <strong>թույլատրվում</strong>&nbsp;տրասնպորտային միջոցի արժեքը նշել
            շուկայականից անտրամաբանական ցածր գներով։ Նման գնային
            մանիպուլյացիաները մենք համարում ենք ոչ բարեխիղճ գործիք՝ որոնման
            արդյուքներում ուշադրություն գրավելու համար։
          </p>
          <p>
            &nbsp;- Խորհուրդ ենք տալիս ավտոմեքենայի գինը նշել ՀՀ դրամով`
            “Արժութային կարգավորման և արժութային վերահսկողության մասին” օրենքի
            համաձայն: Կայքի այցելուները միաժամանակ կարող են տեսնել գինը նաև ԱՄՆ
            դոլարով և եվրոյով`&nbsp; ավտոմատ փոխարկման համակարգի օգնությամբ:
          </p>
          <br></br>
          <p>
            Այս պայմանները խախտելու դեպքում հաշիվը կարգելափակվի`{" "}
            <strong>ԱՌԱՆՑ ՆԱԽԱԶԳՈՒՇԱՑՄԱՆ</strong>:
          </p>
          <p>
            * արգելափակումը տեխնիկական գործիք է, որը թույլ չի տալիս խախտում
            կատարած եւ արգելափակված օգտատերին այլեւս օգտվել կայքի
            ծառայություններից գրանցման ընթացքում նշված հեռախոսահամարով եւ էլ.
            հասցեով։ Տեղադրված հայտարարությունը պահպանվում է բազայում, բայց չի
            հրապարկվում, մինչեւ տեղադրման ժամկետի ավարտը։ Հաշվի արգելափակումը
            կարող է հանվել, եթե օգտատերը վերացնի խախտումը եւ նամակով հաստատի, որ
            հետագայում չի խախտի կանոնները: Խախտումները կրկնելու դեպքում մենք
            իրավունք ենք վերապահում արգելափակել էլ. հասցեն եւ հեռախոսահամարը՝
            առանց վերականգնելու հնարավորության:
          </p>
          <br></br>
          <p>
            <strong>1. Auto</strong>
            <strong>-</strong>
            <strong>am</strong>
            <strong>-ը վաճառվող ավտոտրանսպորտային միջոցների բազա է. </strong>Այն
            օգնում է իր օգտատերերին գնել և վաճառել ավտոմեքենաներ և այլ
            տրանսպորտային միջոցներ։ Կայքի միջոցով այցելուները ներկայացնում են
            իրենց առաջարկները վաճառվող ավտոմեքենաների մասին: Auto.am-ը
            ավտոմեքենաների ուղղակի վաճառք չի իրակայացնում և վաճառողների կամ
            գնորդների միջև գործարքների կողմ երբևէ չի հանդիսանում: Հետևաբար,
            Auto.am-ը` ա) չի երաշխավորում որևէ գործարք գնորդի և վաճառողի միջև,
            բ) չի իրականացնում կամ փոխանցում վճարումներ գնորդների կամ
            վաճառողների անունից, գ) չի կայանում, պահեստավորում կամ փոխադրում
            որևէ տրանսպորտային միջոցներ և դ) պատասխանատու չէ գնորդների և
            վաճառողների միջև առաջացած հնարավոր տարաձայնությունների կամ վեճերի
            համար:<br></br>
            <br></br>
            <strong>
              <strong>2. Վճարումներ:&nbsp;</strong>
            </strong>
            Auto.am կայքում հայտարարությունների տեղադրումն անվճար է։ Վճարումներ
            նախատեսված են միայն վաճառքի բաժնում առաջարկվող լրացուցիչ
            ծառայությունների դիմաց: Մենք կարող ենք ցանկացած ժամանակ մեր
            հայեցողությամբ ամբողջությամբ կամ մասամբ դադարեցնել կամ փոփոխել
            Auto.am կայքում առաջարկվող վճարովի ծառայությունների տեսակը և քանակը`
            նախապես տեղեկացնելով այցելուներին փոփոխությունների բնույթի մասին։
          </p>
          <p>
            Ծառայությունների համար վճարումը չի ենթադրում առանձնահատուկ
            վերաբերմունք հայտարարության նկատմամբ: Եթե հայտարարությունը խախտում է
            կայքի Օգտագործման կանոնները, տեղադրված է ոչ համապատասխան բաժնում կամ
            պարունակում է ոչ պատշաճ տեղեկություն, ապա այն կհեռացվի կայքից: Այդ
            դեպքում այն չի վերականգնվի, ծառայությունը չի տարածվի այլ
            հայտարարության վրա, իսկ գումարի փոխհատուցում չի կատարվի:<br></br>
            <br></br>Կայքի աշխատանքի հետ կապված հնարավոր տեխնիկական խնդիրների
            դեպքում, որոնց պատճառով ձախողվել է վճարովի ծառայություններից մեկի
            ակտիվացումը, Auto.am կայքը երաշխավորում է ծառայության ամբողջովին
            մատուցումը հաճախորդին` վճարման ապացույցների առկայության դեպքում
            (վճարման անդորրագրեր, բակային էլէկտրոնային տեղեկանք / անդորրագրեր):
            Ծառայությունների դիմաց վճարված գումարը չի վերադարձվում:<br></br>
            <br></br>Վճարովի ծառայությունների ակտիվացումը կարող է ձախողվել
            ինչպես կայքում ծագած, այնպես էլ Auto.am-ում ներկայացված վճարային
            համակարգերում առաջացած խնդիրների պատճառով: Տվյալ դեպքերում
            հաճախորդները պետք է դիմեն նշված վճարային համակարգերի սպասարկման
            ծառայություններին, կամ իրենց քարտը սպասարկող Բանկին:<br></br>
            <br></br>
          </p>
          <p>
            <strong>3. Auto.am-ը սոցիալական ցանցերում:</strong>
          </p>
          <p>
            Auto.am կայքը սոցիալական էջերում ունի հետեւյալ պաշտոնական էջերը՝
          </p>
          <p>
            Facebook`{" "}
            <a
              href="https://www.facebook.com/auto.am/"
              style={{ color: "#1976d2" }}
            >
              https://www.facebook.com/auto.am/
            </a>
            <br></br>Instagram`{" "}
            <a
              href="https://www.instagram.com/auto.am/"
              style={{ color: "#1976d2" }}
            >
              https://www.instagram.com/auto.am/
            </a>
            <br></br>Ok.ru `{" "}
            <a href="https://ok.ru/auto.am" style={{ color: "#1976d2" }}>
              https://ok.ru/auto.am
            </a>
            <br></br>Twitter`
            <a
              href="https://twitter.com/autodotam/"
              style={{ color: "#1976d2" }}
            >
              {" "}
              https://twitter.com/autodotam/
            </a>
            <br></br>Youtube`{" "}
            <a
              href="https://www.youtube.com/user/AutoamCarNews"
              style={{
                color: "#1976d2",
              }}
            >
              https://www.youtube.com/AutoamCarNews
            </a>
          </p>
          <br></br>
          <p>
            Սոցիալական էջերում մենք կիսվում ենք մեր կայքին վերաբերող
            նորություններով, համաշխարհային ավտոլուրերով, ինչպես նաև կապ ենք
            պահպանում մեր օգտատերերի հետ։
          </p>
          <br></br>
          <p>
            <strong>4. Auto.am-ի իրավունքները: </strong>Հաշվի առնելով կայքի
            բնույթը և հաղորդագրությունների և հայտարարությունների ծավալը,
            Auto-am-ը չի կարող վերահսկել և դիտարկել ձեր կողմից տեղադրված բոլոր
            հայտարարությունները: Auto-am-ը իրավունք է վերապահում, իր սեփական
            հայեցողությամբ, ցանկացած ժամանակ և ցանկացած պատճառաբանությամբ
            դիտարկել, հրաժարվել հրապարակել, տեղափոխել, հեռացնել կամ խմբագրել ձեր
            կողմից տեղադրված հայտարարությունները: Օգտվելով այս կայքից, դուք
            համաձայնվում եք, որ Auto.am-ը ա) պատասխանատվություն չի կրում
            Նյութերի հետ կապված կամ դրանցից բխող որևէ բողոքների,
            գործողությունների և դատական որոշումների հետ, և բ) կարող է ցանկացած
            ժամանակ և ցանկացած պատճառաբանությամբ դիտարկել, հրաժարվել հրապարակել,
            տեղափոխել, հեռացնել կամ խմբագրել ձեր կողմից տեղադրված
            հայտարարությունները` չկրելով պատասխանատվություն և առանց փոխհատուցման
            պարտավորության:<br></br>
            <br></br>
            <strong>5. Արգելված գործողություններ:</strong> Ստորև ներկայացվում է
            գործողությունների ցանկը, որոնք արգելվում է իրականացնել Կայքի
            միջոցով. (ա) տեղադրել նյութեր, որոնք ակնհայտորեն վիրավորական են
            օն-լայն հանրության համար, մասնավորապես նյութեր, որոնք քարոզում են
            ռասիզմ, ծայրահեղականություն, ատելություն կամ ֆիզիկական վնասի կոչեր
            են պարունակում որևէ խմբի կամ անհատի հացեին, (բ) ներգրավվել
            գործողությունների կամ տեղադրել Նյութեր, որոնք կարող են վնաս հասցնել
            անչափահասներին, (գ) ներգրավվել գործողություններում կամ տեղադրել
            Նյութեր, որոնք կարող են խտրականության ենթարկել կամ խրախուսել
            խտրականությունը որևէ անձի նկատմամբ, (դ) ներգրավվել
            գործողություններում կամ տեղադրել Նյութեր, կամ տրամադրել
            տեղեկատվություն, որը խարդախ է, կեղծ և մոլորության մեջ մտցնող կամ
            խրախուսում է անօրինական գործողություններ կամ արարքներ, որոնք
            վիրավորական են, վտանգավոր, անպարկեշտ, վարկաբեկիչ կամ զրպարտիչ, (ե)
            տեղադրել Նյութեր, որոնք ունեն պոռնոգրաֆիկ կամ սեքսուալ բնույթ, (զ)
            տեղադրել Նյութեր, որոնք տրամադրում են ուսուցողական տեղեկատվություն
            անօրինական գործողությունների մասին, ինչպիսիք են անօրինական զենքի
            արտադրությունը և առևտուրը, որևէ մեկի գաղտնիության խախտումը, կամ
            համակարգչային վիրուսների տրամադրումը կամ ստեղծումը, (է) ներգրավվել
            գործողություններում կամ տեղադրել Նյութեր, որոնք անօրինական
            նպատակաների համար կորզում են այլ Օգտագործողների գաղտնաբառերը կամ
            ինքնության հաստատման տեղեկատվությունը, (ը) օգտագործել որևէ միջոց կամ
            ծրագիր` Կայքի նորմալ աշխատանքին խոչընդոտելու կամ խոչընդոտել փորձելու
            համար, (թ) ցանկացած գործողություն` ուղղված Auto.am կայքի ծրագրային
            կոդի աղբյուրի վնասմանը կամ ձեռքբերմանը:<br></br>
            <br></br>
            <strong>6. Ծառայության դադարեցում:</strong> Դուք հասկանում և
            համաձայնվում եք, որ Auto.am-ը կարող է իր հայեցողությամբ և առանց
            նախնական ծանուցագրի դադարեցնել կամ ժամանակավորապես արգելել ձեր
            մուտքը Կայք, և Auto.am-ը կարող է օգտագործել ցանկացած այլ միջոց և
            հեռացնել ցանկացած Նյութեր, եթե Auto.am-ը համարի, որ ձեր կողմից կայքի
            օգտագործումը կամ ձեր կողմից տրամադրված Նյութերը (ա) խախտում են (i)
            այս <strong>Օգտագործման կանոնները</strong>, (ii) Auto.am-ի,
            Դիլերների և օգտագործողների իրավունքները կամ (iii) ցանկացած օրենք կամ
            կանոնակարգ կամ (բ) հիմնված են խարդախության վրա: Auto.am-ը չի
            պարտավորվում որևէ փոխհատուցում կատարել, եթե Գրանցված օգտագործողի ձեր
            կարգավիճակը դադարեցվել է, քանի որ, Auto.am-ի հայեցողությամբ, դուք
            խախտել եք այս Օգտագործման կանոնները:<br></br>
            <br></br>
            <strong>7.</strong>&nbsp;<strong>Լրացուցիչ:</strong> Այս{" "}
            <strong>Օգտագործման կանոնները</strong> կարող են փոփոխվել ցանկացած
            ժամանակ և դուք կտեղեկացվեք այդ փոփոխությունների մասին` Կայքի այս
            էջում զետեղված <strong>Օգտագործման կանոնների</strong>&nbsp;թարմացված
            տարբերակների միջոցով: Ձեր կողմից Կայքի շարունակական օգտագործումը
            փոփոխված <strong>Օգտագործման կանոնների</strong>&nbsp;տեղադրումից
            հետո նշանակում է, որ դուք համաձայն եք այդ փոփոխությունների հետ:
            Auto.am-ը կարող է փոփոխել, դադարեցնել կամ սահմանափակել կայքի որևէ
            մասի գործողությունն առանց նախնական ծանուցման: Այս կայքը պարունակում
            է հղումներ դեպի այլ կայքեր, որոնք հիմնված չեն կամ չեն վերահսկվում
            Auto.am-ի կողմից: Auto.am-ը չի հաստատում, հովանավորում կամ
            երաշխավորում այդ կայքերում տեղադրված տեղեկատվության հավաստիությունը
            և պատասխանատվություն չի կրում այդ կայքերում առկա
            մեկնաբանությունների, ծառայությունների, հաղորդագրությունների համար:
          </p>
        </div>
      </Box>
      <ScrollTop {...props}>
        <Fab size="small" aria-label="scroll back to top">
          <KeyboardArrowUpIcon />
        </Fab>
      </ScrollTop>
    </Container>
  );
}
